/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Zaznaczonej zawartości nie można odtworzyć.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Nie można znaleźć żadnej zawartości.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Nie można odtworzyć bieżącego utworu.";


/* kBRMediaNoContent*/
300 = "Nie znaleziono żadnej zawartości.";

/* kBRMediaNoPhotoContent */
301 = "W twojej bibliotece iPhoto nie ma żadnych zdjęć.";

/* kBRMediaNoPodcastContent */
302 = "W twojej bibliotece iTunes nie ma żadnych podcastów.";

/* kBRMediaNotDRMAuthorized */
303 = "Nie masz autoryzacji do odtwarzania tych materiałów.";

/* kBRMediaNoMovieFolderContent */
304 = "W twoim katalogu Filmy brak filmów do odtwarzania.";

/* kBRMediaNoTVShowContent */
305 = "W twojej bibliotece iTunes nie ma żadnych programów TV.";

/* kBRMediaNoMusicVideoContent */
306 = "W bibliotece muzycznej iTunes nie ma muzycznych wideo.";

/* kBRMediaNoPlaylists */
307 = "Nie ma żadnych list odtwarzania w twojej bibliotece iTunes.";

/* kBRMediaNoSongContent */
308 = "W bibliotece iTunes nie ma żadnych utworów.";

/* kBRMediaNoAudioBookContent */
309 = "Brak książek audio w twojej bibliotece iTunes.";

/* kBRMediaEmptyPlaylist */
310 = "Brak utworów na tej liście odtwarzania.";

/* kBRMediaNoSuchPlaylist */
311 = "Nie można było znaleźć zaznaczonej listy odtwarzania.";

/* kBRMediaNoSuchSong */
312 = "Nie można było znaleźć zaznaczonego utworu.";

/* kBRMediaNoMovies */
315 = "W twoim katalogu Filmy nie ma żadnych filmów.";

/* kBRMediaNoSongForSlideshow */
316 = "Nie można było odtworzyć utworu z tego pokazu slajdów.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Nie można było odtworzyć utworu z tego pokazu slajdów.";

/* kBRVideoUnplayable */
318 = "Nie można było odtworzyć zaznaczonego wideo.";

/* kBRMediaRadioStreamUnplayable */
319 = "Zaznaczony strumień przekazu radiowego nie mógł być odtworzony. ";

/* kBRRemoteMediaNoContent*/
350 = "W tej bibliotece nie znaleziono żadnej zawartości.";

/* kBRRemoteMediaNoPhotoContent */
351 = "W tej bibliotece nie ma żadnych zdjęć.";

/* kBRRemoteMediaNoPodcastContent */
352 = "W tej bibliotece nie ma żadnych podcastów.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Nie masz autoryzacji do odtwarzania tych materiałów.";

/* kBRRemoteMediaNoTVShowContent */
355 = "W tej bibliotece nie ma żadnych programów TV.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "W tej bibliotece nie ma żadnych muzycznych wideo.";

/* kBRRemoteMediaNoPlaylists */
357 = "W tej bibliotece nie ma żadnych list odtwarzania.";

/* kBRRemoteMediaNoSongContent */
358 = "W tej bibliotece nie ma żadnych utworów.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "W tej bibliotece nie ma żadnych książek audio.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Brak utworów na tej liście odtwarzania.";

/* kBRRemoteMediaLoadingError */
361 = "Wystąpił błąd podczas wczytywania tej zawartości.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Źródło udostępniania zdjęć jest niedostępne.";

/* kBRDataSourceInitializationFailure*/
400 = "Nie znaleziono żadnej zawartości.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Nie znaleziono żadnej zawartości.";

/* kBRDataSourceConnectionInProgressError */
420 = "Już następuje próba połączenia się z tym źródłem.";


/* KBRSystemNetworkHostUnreachable */
501 = "Nie można połączyć się z tą biblioteką.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "W tym momencie nie można odtworzyć zwiastuna kinowego.";

/* kBRSystemNotHDCPCompliant */
503 = "Odtwarzanie tej zawartości wymaga obsługi HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Nie można było zmienić języka.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Płyta DVD nie może być w tym momencie odtwarzana.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "Nie można wysunąć DVD.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "Kod regionu płyty DVD nie pokrywa się z kodem odtwarzacza DVD.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "Nie można odtworzyć DVD.";

/* kBRDVDErrorFatalDVDAlert */
754 = "Nie można odtworzyć DVD.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Nie można wysunąć płyty CD.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Nie można sprawdzić zabezpieczeń przed kopiowaniem tej płyty.";

/* kBRInternalResourceError */
900 = "Wystąpił błąd";

